Revit 2027 API
AdvancedLossFactor(Double, Double, Double, Double, Double, Double, Double) Constructor
 Creates an advanced loss factor object with the given values.
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public AdvancedLossFactor(
	double ballastLossFactorIn,
	double lampLumenDepreciationIn,
	double lampTiltLossFactorIn,
	double luminaireDirtDepreciationIn,
	double surfaceDepreciationLossFactorIn,
	double temperatureLossFactorIn,
	double voltageLossFactorIn
)
Public Sub New (
	ballastLossFactorIn As Double,
	lampLumenDepreciationIn As Double,
	lampTiltLossFactorIn As Double,
	luminaireDirtDepreciationIn As Double,
	surfaceDepreciationLossFactorIn As Double,
	temperatureLossFactorIn As Double,
	voltageLossFactorIn As Double
)
public:
AdvancedLossFactor(
	double ballastLossFactorIn,
	double lampLumenDepreciationIn,
	double lampTiltLossFactorIn,
	double luminaireDirtDepreciationIn,
	double surfaceDepreciationLossFactorIn,
	double temperatureLossFactorIn,
	double voltageLossFactorIn
)
new :
        ballastLossFactorIn : float *
        lampLumenDepreciationIn : float *
        lampTiltLossFactorIn : float *
        luminaireDirtDepreciationIn : float *
        surfaceDepreciationLossFactorIn : float *
        temperatureLossFactorIn : float *
        voltageLossFactorIn : float -> AdvancedLossFactor
Parameters
ballastLossFactorIn Double
 The ballast loss factor as a numerical value between 0.0 and 1.0.
lampLumenDepreciationIn Double
 The lamp lumen depreciation loss factor as a numerical value between 0.0 and 1.0.
lampTiltLossFactorIn Double
 The lamp tilt loss factor as a numerical value between 0.0 and 1.0.
luminaireDirtDepreciationIn Double
 The luminaire dirt depreciation loss factor as a numerical value between 0.0 and 1.0.
surfaceDepreciationLossFactorIn Double
 The surface depreciation loss factor as a numerical value between 0.0 and 1.0.
temperatureLossFactorIn Double
 The temperature loss factor as a numerical value between 0.0 and 2.0.
voltageLossFactorIn Double
 The voltage loss factor as a numerical value between 0.0 and 2.0.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  The loss factor is not valid because it is not between 0.0 and 1.0. -or- The loss factor is not valid because it is not between 0.0 and 2.0.
See Also
Reference
AdvancedLossFactor Class
AdvancedLossFactor Overload
Autodesk.Revit.DB.Lighting Namespace